app/controllers/school_classes_controller.rb

    def update
      @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-02-26 22:42:01.164095"], ["id", 1]]